//////////////////////////////////////////////////////
// 程序名称：多笔绘制
// 功	能：多笔绘制如图所示的图形
// 编译环境：VS2019，EasyX_20220116
// 作	者：夏婉可<2020301010225><1597493790@qq.com>
// 最后修改：2022-2-24

#include <graphics.h>		// 引用图形库头文件
#include <conio.h>
int main()
{
	initgraph(640, 480);	// 创建绘图窗口，大小为 640x480 像素

	for (int x = 160; x <= 480; x += 20) {
		line(160, 240, x, 120);
		line(160, 240, x, 360);
		line(480, 240, 640 - x, 120);
		line(480, 240, 640 - x, 360);
	}

	_getch();				// 按任意键继续
	closegraph();			// 关闭绘图窗口
	return 0;
}
